[
    {
    "id": "1",
    "title": "Machine Learning",
    "price": 99,
    "description": "Machine learning (ML) is a type of artificial intelligence (AI) that allows software applications to become more accurate at predicting outcomes without being explicitly programmed to do so. Machine learning algorithms use historical data as input to predict new output values.",
    "category": "Data Science",
    "image": "https://miro.medium.com/max/1400/1*c_fiB-YgbnMl6nntYGBMHQ.jpeg",
    "rating": {
    "rate": 4.7,
    "count": 120
    }
    },
    {
    "id": "2",
    "title": "Android App Development",
    "price": 120,
    "description": "Android is an open source and Linux-based operating system for mobile devices such as smartphones and tablet computers. Android was developed by the Open Handset Alliance, led by Google, and other companies. This tutorial will teach you basic Android programming and will also take you through some advance concepts related to Android application development.",
    "category": "Android",
    "image": "https://www.freecodecamp.org/news/content/images/2019/10/androiddevelopment.png",
    "rating": {
    "rate": 4.1,
    "count": 259
    }
    },
    {
    "id": "3",
    "title": "C++",
    "price": 89,
    "description": "C++ is an object-oriented programming language which gives a clear structure to programs and allows code to be reused, lowering development costs. C++ is portable and can be used to develop applications that can be adapted to multiple platforms.",
    "category": "Programming",
    "image": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/titleShadow-1024x341.png",
    "rating": {
    "rate": 4.7,
    "count": 500
    }
    },
    {
    "id": "4",
    "title": "Data Science",
    "price": 159,
    "description": "Data science is an interdisciplinary field that uses scientific methods, processes, algorithms and systems to extract or extrapolate knowledge and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of application domains.",
    "category": "Data Science",
    "image": "https://www.dataquest.io/wp-content/uploads/2019/05/what-is-data-science-1.jpg",
    "rating": {
    "rate": 4.1,
    "count": 430
    }
    },
    {
    "id": "5",
    "title": "React JS",
    "price": 99,
    "description": "React (also known as React.js or ReactJS) is a free and open-source front-end JavaScript library for building user interfaces based on UI components. It is maintained by Meta (formerly Facebook) and a community of individual developers and companies. React can be used as a base in the development of single-page, mobile, or server-rendered applications with frameworks like Next.js. However, React is only concerned with state management and rendering that state to the DOM, so creating React applications usually requires the use of additional libraries for routing, as well as certain client-side functionality.",
    "category": "JavaScript",
    "image": "https://freeprojectscodes.com/wp-content/uploads/2022/06/React-js-projects-for-beginners-with-source-code.png",
    "rating": {
    "rate": 4.6,
    "count": 400
    }
    },
    {
    "id": "6",
    "title": "Redux",
    "price": 99,
    "description": "Redux is a predictable state container designed to help you write JavaScript apps that behave consistently across client, server, and native environments, and are easy to test.",
    "category": "Javascript",
    "image": "https://chriscourses.com/img/blog/redux/redux.jpg",
    "rating": {
    "rate": 3.9,
    "count": 70
    }
    },
    {
    "id": "7",
    "title": "UI/UX",
    "price": 99,
    "description": "UX design refers to the term “user experience design”, while UI stands for “user interface design”. Both elements are crucial to a product and work closely together. But despite their professional relationship, the roles themselves are quite different, referring to very different aspects of the product development process and the design discipline.",
    "category": "Design",
    "image": "https://arenajayanagar.com/images/uiux.jpg",
    "rating": {
    "rate": 3,
    "count": 400
    }
    },
    {
    "id": "8",
    "title": "Python",
    "price": 119,
    "description": "Python is a high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation. Python is dynamically-typed and garbage-collected. It supports multiple programming paradigms, including structured (particularly procedural), object-oriented and functional programming. It is often described as a batteries included language due to its comprehensive standard library.",
    "category": "Programming",
    "image": "https://logicoretech.com/wp-content/uploads/2022/05/Python-Symbol.png",
    "rating": {
    "rate": 4.9,
    "count": 100
    }
    },
    {
    "id": "9",
    "title": "Javascript",
    "price": 119,
    "description": "JavaScript often abbreviated as JS, is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS. As of 2022, 98% of websites use JavaScript on the client side for webpage behavior, often incorporating third-party libraries. All major web browsers have a dedicated JavaScript engine to execute the code on users' devices. JavaScript is a high-level, often just-in-time compiled language that conforms to the ECMAScript standard. It has dynamic typing, prototype-based object-orientation, and first-class functions. It is multi-paradigm, supporting event-driven, functional, and imperative programming styles. It has application programming interfaces (APIs) for working with text, dates, regular expressions, standard data structures, and the Document Object Model (DOM).",
    "category": "Programming",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/2048px-Unofficial_JavaScript_logo_2.svg.png",
    "rating": {
    "rate": 4.3,
    "count": 203
    }
    }
]